venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
/*
  By Venice
  Get CORENAME from MiSTer via USB-Serial-TTY Device and show CORENAME related text, Pictures or Logos
  Using forked Adafruit SSD1327 Library https://github.com/adafruit/Adafruit_SSD1327 for the SSD1322

  -- G R A Y S C A L E  E D I T I O N --

  Needed libraries for the Arduino program:
  - Adafruit GFX (*)
  - U8G2 for Adafruit GFX (*)
  - Bounce2 (*) optional, needed for the tilt-sensor
  - ESP32Time (*) needed for all ESP32 Boards 
  - MIC184 needed for the MIC145 sensor on d.ti's boards, get it from: https://github.com/venice1200/MIC184_Temperature_Sensor/releases
  - SSD1322 for Adafruit GFX, download and extract it from here: https://github.com/venice1200/SSD1322_for_Adafruit_GFX/releases/latest
  (*) These Libraries can be installed using Arduino's library manager.
  See also https://github.com/venice1200/MiSTer_tty2oled/wiki/Arduino-HowTo-%28Windows%29

  QuickSelect/Copy&Paste for Arduino IDE v2.x:
  
  -ESP32-S3 Dev Module
  -ESP32 Dev Module
  -WEMOS LOLIN32
  -NodeMCU 1.0
   
  See changelog.md in Sketch folder for more details
  
  ToDo
  -Check why dtiv>=13 (Reason = POR of PCA9536) If the Power Cycle is too short the PCA9536 locks his state
  -Everything I forgot
   
  Defines?!
  I use a lot "#ifdef's...endif" to enable code for a specific MCU Type.
  USE_ESP32S3DEV   An ESP32-S3 is used with the Arduino IDE Profile "ESP32-S3 Dev Module".
  USE_ESP32DEV     An ESP32 is used with the Arduino IDE Profile "ESP32 Dev Module".
  USE_LOLIN32      An ESP32 is used with the Arduino IDE Profile "WEMOS LOLIN32".
  USE_NODEMCU      An ESP8266 is used with the Arduino IDE Profile  "NodeMCU 1.0 (ESP-12E Module)".
  USE_ESP32XDEV    An ESP32-S3 is used with the Arduino IDE Profile "ESP32-S3 Dev Module" OR an ESP32 is used with the Arduino IDE Profile "ESP32 Dev Module".
  ESP32X           An ESP32-S3 or ESP32 is used.
 
*/

// Set Version
#define BuildVersion "240906-v3T"                  // "T" for Testing

// Include Libraries
#include <Arduino.h>
#include <SSD1322_for_Adafruit_GFX.h>             // SSD1322 Controller Display Library https://github.com/venice1200/SSD1322_for_Adafruit_GFX
#include <U8g2_for_Adafruit_GFX.h>                // U8G2 Font Engine for Adafruit GFX  https://github.com/olikraus/U8g2_for_Adafruit_GFX
#include "bitmaps.h"                              // Some needed pictures
#include "fonts.h"                                // Some needed fonts


// ---------------------------------------------------------------------------------------------------------------------
// ------------------------------------------- Activate your Options ---------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// How-To...
// Comment (add "//" in front of the Option) to de-activate the Option
// Uncomment (remove "//" in front of the Option) to activate the Option

// Get Debugging Infos over Serial
//#define XDEBUG

// Uncomment for 180° StartUp Rotation (Display Connector up)
//#define XROTATE

// ---------------------------------------------------------------------------------------------------------------------
// ---------------------------------- Auto-Board-Config via Arduino IDE Board Selection --------------------------------
// ----------------------------------- Make sure the Manual-Board-Config is not active ---------------------------------
// ---------------------------------------------------------------------------------------------------------------------

#ifdef ARDUINO_ESP32S3_DEV        // Set Arduino Board to "ESP32-S3 Dev Module"
  #define USE_ESP32S3DEV          // ESP32-S3-DevKitC-1
#endif

#ifdef ARDUINO_ESP32_DEV          // Set Arduino Board to "ESP32 Dev Module"
  #define USE_ESP32DEV            // TTGO-T8, tty2oled Board by d.ti
#endif

#ifdef ARDUINO_LOLIN32            // Set Arduino Board to "WEMOS LOLIN32"
  #define USE_LOLIN32             // Wemos LOLIN32, LOLIN32, DevKit_V4
#endif

#if defined(ARDUINO_ESP8266_NODEMCU) || defined(ARDUINO_ESP8266_NODEMCU_ESP12E)  // Set Arduino Board to "NodeMCU 1.0 (ESP-12E Module)"
  #define USE_NODEMCU             // ESP8266 NodeMCU v3
#endif

// ---------------------------------------------------------------------------------------------------------------------
// ------------------------------------------------ Manual-Board-Config ------------------------------------------------
// ------------------------------------ Make sure the Auto-Board-Config is not active ----------------------------------
// ---------------------------------------------------------------------------------------------------------------------

//#define USE_ESP32S3DEV         // ESP32-S3-DevKitC-1
//#define USE_ESP32DEV           // TTGO-T8. Set Arduino Board to ESP32 Dev Module, xx MB Flash, def. Part. Schema
//#define USE_LOLIN32            // Wemos LOLIN32, LOLIN32, DevKit_V4. Set Arduino Board to "WEMOS LOLIN32"
//#define USE_NODEMCU            // ESP8266 NodeMCU v3. Set Arduino Board to NodeMCU 1.0 (ESP-12E Module)


// ---------------------------------------------------------------------------------------------------------------------
// ---------------------------------- Is the System ESP32 / ESP32-S3 based? --------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

#if defined(ESP32) || defined(ESP32S3)
  #define ESP32X
#endif

#if defined(USE_ESP32DEV) || defined(USE_ESP32S3DEV)
  #define USE_ESP32XDEV
#endif

// ---------------------------------------------------------------------------------------------------------------------
// -------------------------------------------------- Hardware-Config --------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// ESP32-S3
// SPI Original: CS(FSPICS0) = 10, MOSI(FSPID) = 11, SCLK(FSPICLK) = 12, MISO(FSPIQ) = 13
#ifdef USE_ESP32S3DEV
  int cDelay = 15;                 // Command Delay in ms for ACK-Handshake
  #define OLED_MOSI 1
  #define OLED_MISO 45 
  #define OLED_SCLK 39
  #define OLED_CS 18
  #define OLED_DC 17
  #define OLED_RESET 8
  #define TILT_PIN 15
  #define I2C1_SDA 37              // I2C_1-SDA
  #define I2C1_SCL 36              // I2C_1-SCL
  #define USER_LED 40              // USER_LED/WS2812B Pin on d.ti Board
  //#define USER_LED 48              // USER_LED/WS2812B Pin on ESP32-S3-DevKitC-1
  #define POWER_LED 38             // Set Pin to "1" = LED's off
  #define BUZZER 35                // Piezo Buzzer
  #define LEDC_FREQ 12000          // LED Control API Frequency, see: https://docs.espressif.com/projects/arduino-esp32/en/latest/api/ledc.html 
  #define LEDC_RESO 8              // LED Control API Resolution
  #include <MIC184.h>              // MIC184 Library, get from https://github.com/venice1200/MIC184_Temperature_Sensor
  MIC184 tSensor;                  // Create Sensor Class
  #include <FastLED.h>             // FastLED Library, get from Library Manager
  #define NUM_WSLEDS 1             // Number of WS-LED's
  #define WS_BRIGHTNESS 50         // WS-LED Brightness
  CRGB wsleds[NUM_WSLEDS];         // Create WS-LED RGB Array
  #define PCA_POWER 48             // Switch PCA9536 on=0 and off=1 (without defining the Port as output the PCA is off)
 //SPIClass OLED_SPI(HSPI);
  SPIClass OLED_SPI(SPI);
  #include <Preferences.h>         // Needed for d.ti Board Revisions
  Preferences prefs;
#endif

