venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
// Star Field Simulation
bool ShowScreenSaverStarField=false;          // Star Field ScreenSaver yes/no
const int starCount = 512;                    // Number of Stars in the Star Field ESP32
const int maxDepth = 32;                      // Maximum Distance away for a Star
double stars[starCount][3];                   // The Star Field - StarCount Stars represented as X, Y and Z Cooordinates
#define SCRSTARS 1

// Flying Toaster
bool ShowScreenSaverToaster=false;            // Flying Toasters ScreenSaver yes/no
#define TOAST_FLYERS   5 // Number of flying things
#define TOAST_MPIX 16    // Micropixel
#define TOAST_DELAY 50   // Toaster Delay
struct Flyer {       // Array of flying things
  int16_t x, y;      // Top-left position * 16 (for subpixel pos updates)
  int8_t  depth;     // Stacking order is also speed, 12-24 subpixels/frame
  uint8_t frame;     // Animation frame; Toasters cycle 0-3, Toast=255
} flyer[TOAST_FLYERS];
#define SCRTOASTER 2
#endif  // ESP32 Screensaver

// I2C Hardware
bool hasMIC=false;                            // tty2oled has a MIC184 Sensor (all d.to Boards)
const byte PCA9536_ADDR = 0x41;               // PCA9536 Base Address
const byte PCA9536_IREG = 0x00;               // PCA9536 Input Register
bool hasPCA=false;                            // tty2oled has a PCA9536 Port-Extender (d.ti Board >=v1.2)
//byte pcaInputValue=255;                     // PCA9536 Input Pin State as Byte Value
byte pcaInputValue=0;                         // PCA9536 Input Pin State as Byte Value
byte dtiv=0;                                  // d.ti Board Version 11=1.1, 12=1.2
byte edtiv=0;                                 // d.ti Board Version read/write from/to EERPOM 
bool usePREFS=false;                          // Got d.ti Board version from "Preferences" Values
bool hasLED=false;                            // tty2oled has a LED (d.ti Board = v1.1)
bool hasRGBLED=false;                         // tty2oled has a RGB LED (d.ti Board >=v1.2)
bool hasBUZZER=false;                         // tty2oled has a Buzzer (d.ti Board >=v1.2)
bool hasPLED=false;                           // tty2oled has a PowerLED (d.ti Board >=v1.2)


// =============================================================================================================
// ========================================== FUNCTION PROTOTYPES ==============================================
// =============================================================================================================

void oled_showStartScreen(void);
void oled_setTime(void);
void oled_setcdelay(void);
void oled_showcdelay(void);
void oled_switchscreensaver(void);
void oled_readnsetscreensaver(void);
void oled_showScreenSaverPicture(void);
void oled_showSmallCorePicture(int xpos, int ypos);
void oled_showSystemHardware(void);
void oled_sendHardwareInfo(void);
void oled_drawlogo64h(uint16_t w, const uint8_t *bitmap);
void oled_showcorename();
void oled_displayoff(void);
void oled_displayon(void);
void oled_updatedisplay(void);
void oled_readnsetcontrast(void);
void oled_showperror(void);
void oled_showcenterredtext(String text, int font);
void oled_setfont(int font);
void oled_readnsetrotation(void);
void oled_clswithtransition();
void oled_showpic(void);
int oled_readlogo();
void oled_drawlogo(uint8_t e);
void oled_drawEightPixelXY(int x, int y, int dx, int dy);
void oled_readnwritetext(void);
void oled_readndrawgeo(void);
void oled_showtemperature();
void oled_readnsetuserled(void);
void oled_settempzone(void);
void oled_readnsetpowerled(void);
void oled_playnote(void);
void oled_playtone(void);
void oled_drawScreenSaverStarField(void);
void oled_showtime(void);
void oled_enableOTA (void);
int getRandom(int lower, int upper);
void oled_drawScreenSaverStarField(void);
void oled_drawScreenSaverToaster(void);
void oled_readnsetedtiv(void);
void oled_setttyack(void);

// Info about overloading found here
// https://stackoverflow.com/questions/1880866/can-i-set-a-default-argument-from-a-previous-argument
inline void oled_drawEightPixelXY(int x, int y) { oled_drawEightPixelXY(x,y,x,y); };

// =============================================================================================================
// ================================================ SETUP ======================================================
// =============================================================================================================

void setup(void) {
  String bversion = BuildVersion;

  if (bversion.endsWith("T")) runsTesting=true;     // Running Testing Yes/No?

  Serial.begin(115200);                      // Init Serial with 115200 for MiSTer ttyUSBx Device CP2102 Chip on ESP32
  Serial.flush();                            // Wait for empty Send Buffer
  Serial.setTimeout(500);                    // Set max. Serial "Waiting Time", default = 1000ms

  randomSeed(analogRead(34));                // Init Random Generator with empty Port Analog value
  
#ifdef ESP32X  
  rtc.setTime(1640995200);                   // Set Time (2022-01-01) only for ESP32
#endif
  
  // Init SPI for ESP32-S3
#ifdef USE_ESP32S3DEV
  OLED_SPI.begin(OLED_SCLK, OLED_MISO, OLED_MOSI, OLED_CS);
#endif

  // Init Display SSD1322
  oled.begin();
  oled.clearDisplay();
  oled.setRotation(0);
  oled.setContrast(contrast);                       // Set contrast of display
  oled.setTextSize(1);
  oled.setTextColor(SSD1322_WHITE, SSD1322_BLACK);  // White foreground, black background
  //oled.setFont(&FreeSans9pt7b);                   // Set Standard Font (available in 9/12/18/24 Pixel)
  oled.cp437(true);                                 // Enable Code Page 437-compatible charset (bugfix)

  // Init U8G2 for Adafruit GFX
  u8g2.begin(oled); 
  // u8g2.setFontMode(1);                             // Transparent Font Mode, Background is transparent
  u8g2.setFontMode(0);                               // Non-Transparent Font Mode, Background is overwritten (u8g2 default)
  u8g2.setForegroundColor(SSD1322_WHITE);            // apply Adafruit GFX color
  //u8g2.setBackgroundColor(SSD1322_BLACK);

   // Get Display Dimensions
  DispWidth = oled.width();
  DispHeight = oled.height();
  DispLineBytes1bpp = DispWidth / 8;                       // How many Bytes uses each Display Line at 1bpp (32 byte for width 256 Pixel)
  DispLineBytes4bpp = DispWidth / 2;                       // How many Bytes uses each Display Line at 4bpp (128 byte for width 256 Pixel)
  logoBytes1bpp = DispWidth * DispHeight / 8;              // SSD1322 = 2048 Bytes
  logoBytes4bpp = DispWidth * DispHeight / 2;              // SSD1322 = 8192 Bytes
  //logoBin = (uint8_t *) malloc(logoBytes4bpp);             // Create Picture Buffer, better than permanent create (malloc) and destroy (free)

// === Activate Options ===

// Setup d.ti Board (Temp.Sensor/USER_LED/PCA9536)
#ifdef USE_ESP32XDEV                                             // Only for ESP32-DEV or ESP32S3-DEV (TTGO-T8/d.ti)
// Output for d.ti Board Power LED
  pinMode(POWER_LED, OUTPUT);                                    // Set Mode POWER_LED Pin

// I2C Start  
  //Wire.begin(int(I2C1_SDA), int(I2C1_SCL), uint32_t(100000));    // Setup I2C-1 Port
  Wire.begin(int(I2C1_SDA), int(I2C1_SCL));                        // Setup I2C-1 Port
  
// MIC184 Handling  
  Wire.beginTransmission (MIC184_BASE_ADDRESS);                  // Check for MIC184 Sensor...
  if (Wire.endTransmission() == 0) {                             // ..and wait for Answer
    hasMIC=true;                                               // If Answer OK Sensor available
    dtiv=11;                                                     // d.ti Board >= 1.1
  }
  //tSensor.setZone(MIC184_ZONE_REMOTE);                         // Remote = use External Sensor using LM3906/MMBT3906
#ifdef XDEBUG
  if (hasMIC) {
    Serial.println("MIC184 Sensor available.");
    Serial.print("Temperature: ");
    Serial.print(tSensor.getTemp());
    Serial.println("°C");
  }
  else {
    Serial.println("MIC184 Sensor not available.");
  }
#endif  // XDEBUG

