venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
// PCA9536 handling
#ifdef XDEBUG
  Serial.println("Enable PCA");
#endif  // XDEBUG
  digitalWrite(PCA_POWER,0);                                     // Pre-Set Pin
  pinMode(PCA_POWER, OUTPUT);                                    // Set Mode for PCA_POWER Pin
  delay(50);
  digitalWrite(PCA_POWER,1);                                     // Switch PCA On
  delay(50);

  Wire.beginTransmission(PCA9536_ADDR);                          // Check for PCA9536
  if (Wire.endTransmission() == 0) {                             // ..and wait for Answer
    hasPCA=true;                                                 // If Answer OK PCA available
  }
#ifdef XDEBUG
  if (hasPCA) {
    Serial.println("PCA available.");
  }
  else {
    Serial.println("PCA not available.");
  }
#endif  // XDEBUG

  if (hasPCA) {                                                 // If PCA9536 available..
    Wire.beginTransmission(PCA9536_ADDR);                       // start transmission and.. 
    Wire.write(PCA9536_IREG);                                   // read Register 0 (Input Register).
    if (Wire.endTransmission() == 0) {                          // If OK...
      //delay(50);                                              // Just wait 50ms
      Wire.requestFrom(PCA9536_ADDR, byte(1));                  // request one byte from PCA
      if (Wire.available() == 1) {                              // If just one byte is available,
        pcaInputValue = Wire.read() & 0x0F;                     // read it and mask the higher bits out
        dtiv=12+pcaInputValue;                                  // d.ti Board >= 1.2
#ifdef XDEBUG
        Serial.printf("Get PCA Input Register Value: %i.\n", pcaInputValue);
#endif
      }
      else {
        while (Wire.available()) Wire.read();                   // If more byte are available = something wrong
#ifdef XDEBUG
       Serial.println("PCA Error, too much bytes!");
#endif  // XDEBUG
      }
    }
  }
#ifdef XDEBUG
  Serial.println("Disable PCA");
#endif  // XDEBUG
  digitalWrite(PCA_POWER,0);                                     // Switch PCA off

// Preferences dtiv (EEPROM)
  prefs.begin("tty2oled", false);                                // Preferences Handling, open Namespace "tty2oled" in RW Mode
  edtiv=prefs.getUChar("dtiv", 255);                             // Preferences Handling, read "dtiv" with default value "255"
#ifdef XDEBUG
  Serial.printf("Read DTIV %i from Preferences.\n", editv);
#endif  // XDEBUG
  if (edtiv==255) {                                              // Read PCA Value only if EEPROM has no Value
    prefs.putUChar("dtiv", dtiv);                                // Write Value to Preferences Namespace
    prefs.end();                                                 // Close the Preferences
    if (dtiv>10) {
      u8g2.setFont(u8g2_font_5x7_mf);                            // 6 Pixel Font
      u8g2.setCursor(0,63);
      u8g2.printf("d.ti Board v%.1f detected.", (float)dtiv/10);    
      oled.display();
      delay(4000);
      oled.clearDisplay();
    }
#ifdef XDEBUG
    Serial.printf("Writing DTIV to Preferences: %i\n", dtiv);
#endif
  }
  else {
    dtiv=edtiv;                                                    // Use EEPROM Value for dtiv
    usePREFS=true;
  }

  if (dtiv==11) {                                                  // If d.ti Board Rev 1.1
    pinMode(USER_LED, OUTPUT);                                     // Setup User LED
    hasLED=true;                                                   // tty2oled has a LED (d.ti Board v1.1)
  }
  if (dtiv>=12) {                                                  // If d.ti Board Rev 1.2 or greater
    FastLED.addLeds<WS2812B, USER_LED, GRB>(wsleds, NUM_WSLEDS);   // Setup User WS2812B LED
    FastLED.setBrightness(WS_BRIGHTNESS);                          // and set Brightness
    hasRGBLED=true;                                                // tty2oled has a RGB LED (d.ti Board >=v1.2)
    hasBUZZER=true;                                                // tty2oled has a Buzzer (d.ti Board >=v1.2)
    hasPLED=true;                                                  // tty2oled has a PowerLED which can be switched off
  }
#endif  // USE_ESP32DEV

// Setup Animated Screensaver
#ifdef ESP32X
  for (int i = 0; i < starCount; i++) {                            // Initialise the StarField with random Stars
    stars[i][0] = getRandom(-25, 25);
    stars[i][1] = getRandom(-25, 25);
    stars[i][2] = getRandom(0, maxDepth);
  }

  for (int i=0; i<TOAST_FLYERS; i++) {                             // Randomize initial flyer states
    flyer[i].x     = (-32 + random(255+32)) * TOAST_MPIX;
    flyer[i].y     = (-32 + random(63+32)) * TOAST_MPIX;
    flyer[i].frame = random(3) ? random(4) : 255;                  // 66% toaster, else toast
    flyer[i].depth = 10 + random(TOAST_MPIX);                      // Speed and stacking order
  }
#endif // ESP32X

// Tilt Sensor Rotation via Tilt-Sensor Pin
  RotationDebouncer.attach(TILT_PIN,INPUT_PULLUP);         // Attach the debouncer to a pin with INPUT mode
  RotationDebouncer.interval(DEBOUNCE_TIME);               // Use a debounce interval of 25 milliseconds
  delay(10);                                               // Short Delay
  if (digitalRead(TILT_PIN)) {                             // Set Startup Rotation
    oled.setRotation(0);                                   // If Signal = 1 no Rotation
 }
  else {                                                   // If Signal = 0 180° Rotation
    oled.setRotation(2);
  }

// XROTATE Option Rotation
#ifdef XROTATE
  oled.setRotation(2);                                     // 180° Rotation
#endif

// Go...
  oled_showStartScreen();                                  // OLED Startup

  delay(cDelay);                                           // Command Response Delay
  Serial.print("ttyrdy;");                                 // Send "ttyrdy;" after setup is done.
  //Serial.println("ttyrdy;");                             // Send "ttyrdy;" with "\n" after setup is done.
}

