venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
    else if (newCommand.startsWith("CMDTXT")) {                             // Command from Serial to write Text
      oled_readnwritetext();                                                // Read and Write Text
    }
    
    else if (newCommand.startsWith("CMDGEO")) {                             // Command from Serial to draw geometrics
      oled_readndrawgeo();                                                  // Read and Draw Geometrics
    }

    else if (newCommand.startsWith("CMDAPD")) {                             // Command from Serial to receive Picture Data via USB Serial from the MiSTer
      oled_readlogo();                                                      // Receive Picture Data... 
    }

    else if (newCommand.startsWith("CMDCOR")) {                             // Command from Serial to receive Picture Data via USB Serial from the MiSTer
      if (oled_readlogo()==1) {                                             // Receive Picture Data... 
        if (tEffect==-1) {                                                  // Send without Effect Parameter or with Effect Parameter -1
          oled_drawlogo(random(minEffect,maxEffect+1));                     // ...and show them on the OLED with Transition Effect 1..MaxEffect
        } 
        else {                                                              // Send with Effect "CMDCOR,llander,15"
          oled_drawlogo(tEffect);
        }
      }
    }

    else if (newCommand.startsWith("CMDSETTIME,")) {                        // Set date and time but only for ESP32 RTC
      oled_setTime();
    }

    else if (newCommand.startsWith("CMDCON")) {                            // Command from Serial to receive Contrast-Level Data from the MiSTer
      oled_readnsetcontrast();                                             // Read and Set contrast                                   
    }

    else if (newCommand.startsWith("CMDROT")) {                            // Command from Serial to set Rotation
      oled_readnsetrotation();                                             // Set Rotation
    }
    
    else if (newCommand.startsWith("CMDSWSAVER")) {                        // Command from Serial to set Screensaver
      oled_switchscreensaver();                                            // Enable/Disable Screensaver
    }
    
    else if (newCommand.startsWith("CMDSAVER")) {                          // Command from Serial to set Screensaver
      oled_readnsetscreensaver();                                          // Set Screensaver Settings & Enable/Disable
    }

    else if (newCommand.startsWith("CMDSTTYACK")) {                        // Command from Serial to set Screensaver
      oled_setttyack();                                                    // Enable/Disable sendiung TTYACK
    }

// ---------------------------------------------------
// The following Commands are only for the d.ti Board
// ---------------------------------------------------
#ifdef USE_ESP32XDEV
    else if (newCommand.startsWith("CMDULED")) {                           // User LED
      oled_readnsetuserled();                                              // Set LED
    }
    
    else if (newCommand.startsWith("CMDPLED")) {                           // Power Control LED
      oled_readnsetpowerled();                                             // Set LED
    }

    else if (newCommand=="CMDSHTEMP") {                                    // Enable to show Temperature Big Picture
    oled_showtemperature();
    }

    else if (newCommand.startsWith("CMDTZONE")) {                          // Set Temperature Zone
    oled_settempzone();
    }

    else if (newCommand.startsWith("CMDPNOTE")) {                          // Play Note
    oled_playnote();
    }

    else if (newCommand.startsWith("CMDPTONE")) {                          // Play Tone/Frequency
    oled_playtone();
    }

    else if (newCommand.startsWith("CMDWRDTIV")) {                          // Write EEPROM
      oled_readnsetedtiv();
    }
#endif  // USE_ESP32DEV
// ---------------------------------------------------

// ---------------------------------------------------
// The following Commands are only for ESP32 Boards
// ---------------------------------------------------
#ifdef ESP32X  // Reset only for ESP32
    else if (newCommand=="CMDRESET") {                                      // Command from Serial for Resetting the ESP
      ESP.restart();                                                        // Reset ESP
    }

    else if (newCommand=="CMDSHTIME") {                                     // ShowTime
      oled_showtime();
    }
    
#endif  // ESP32

// ---------------------------------------------------
// -- Unidentified Core Name, just write it on screen
// ---------------------------------------------------
    else {
      actCorename=newCommand;
      actPicType=NONE;
      ScreenSaverTimer=0;                        // Reset ScreenSaver-Timer
      ScreenSaverLogoTimer=0;                    // Reset ScreenSaverLogo-Timer
      oled_showcorename();
    }  // end ifs

    if (sendTTYACK) {                                 // Send ACK?
      delay(cDelay);                                    // Command Response Delay
      Serial.print("ttyack;");                        // Handshake with delimiter; MiSTer: "read -d ";" ttyresponse < ${TTYDEVICE}"
    }
    // Serial.flush();                                // Wait for sendbuffer is clear

    updateDisplay=false;                              // Clear Update-Display Flag
  } // endif updateDisplay

// ---------------------------------------------------
// ---------- ScreenSaver if Active -----------------
// ---------------------------------------------------
  // ScreenSaver Logo-Timer
  if (ScreenSaverEnabled && !ScreenSaverActive && blinkpos) ScreenSaverLogoTimer++;
  ScreenSaverActive = (ScreenSaverLogoTimer>=ScreenSaverLogoTime) && ScreenSaverEnabled;
  
  // ScreenSaver Timer
  if (ScreenSaverActive && blinkpos) ScreenSaverTimer++;
  ScreenSaverPos = (ScreenSaverTimer == ScreenSaverInterval) && blinkpos;
  if (ScreenSaverTimer>=ScreenSaverInterval) ScreenSaverTimer=0;

#ifdef USE_NODEMCU
  if (ScreenSaverActive && ScreenSaverPos) {    // Screensaver each 60secs
    oled_showScreenSaverPicture();
  }
#endif

#ifdef ESP32X
  if (ScreenSaverActive && !ShowScreenSaverStarField && !ShowScreenSaverToaster && !ShowScreenSaverAnimated && ScreenSaverPos) {    // Screensaver each 60secs
    oled_showScreenSaverPicture();
  }
  if (ScreenSaverActive && (ShowScreenSaverStarField || (ShowScreenSaverAnimated && (ShowAnimatedScreenSaverNo==SCRSTARS) ))) {                       // StarField ScreenSaver
    oled_drawScreenSaverStarField();
  }
  if (ScreenSaverActive && (ShowScreenSaverToaster || (ShowScreenSaverAnimated && (ShowAnimatedScreenSaverNo==SCRTOASTER) ))) {                         // Flying Toasters ScreenSaver
    oled_drawScreenSaverToaster();
  }
#endif

