venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
// ---------------------------------------------------
} // End Main Loop

// =============================================================================================================
// ============================================== Functions ====================================================
// =============================================================================================================

// --------------------------------------------------------------
// -------------------- Show Start-Up Text ----------------------
// --------------------------------------------------------------
void oled_showStartScreen(void) {
  uint8_t color = 0;

#ifdef XDEBUG
  Serial.println("Show Startscreen");
#endif
  oled.clearDisplay();
  oled.drawXBitmap(82, 0, tty2oled_logo, tty2oled_logo_width, tty2oled_logo_height, SSD1322_WHITE);
  oled.display();
  delay(1000);
  for (int i=0; i<DispWidth; i+=16) {            // Some Animation
    oled.fillRect(i,55,16,8,color);
    color++;
    oled.display();
#ifdef USE_ESP32XDEV
    if (dtiv>=12) {                              // Let the RGB LED light up
      wsleds[0] = CHSV(i,255,255);
      FastLED.show();
    }
#endif
    delay(20);
  }
  for (int i=0; i<DispWidth; i+=16) {            // Remove Animation Line
    oled.fillRect(i,55,16,8,SSD1322_BLACK);
    oled.display();
#ifdef USE_ESP32XDEV
    if (dtiv>=12) {                              // Let the RGB LED light up
      wsleds[0] = CHSV(255-i,255,255);
      FastLED.show();
    }
#endif
    delay(20);
  }
#ifdef USE_ESP32XDEV
  if (dtiv>=12) {
    digitalWrite(POWER_LED,1);                   // Power off Power LED's D2 & D3
    wsleds[0] = CRGB::Black;                     // RGB LED off
    FastLED.show();
  }
#endif
  delay(500);
  u8g2.setFont(u8g2_font_5x7_mf);               // 6 Pixel Font
  u8g2.setCursor(0,63);
  u8g2.print(BuildVersion);
  if (runsTesting) {
    if (hasMIC) u8g2.print("M");
    if (hasPCA) u8g2.print("P");
    if (dtiv>10) u8g2.print(dtiv);
    if (usePREFS) u8g2.print("E");
#ifdef USE_ESP32S3DEV
    u8g2.print("-S3");
#endif
    oled.drawXBitmap(DispWidth-usb_icon_width, DispHeight-usb_icon_height, usb_icon, usb_icon_width, usb_icon_height, SSD1322_WHITE);
  }

#ifdef USE_ESP32XDEV
  if (hasMIC) {
    u8g2.setCursor(111,63);
    u8g2.print(tSensor.getTemp());    // Show Temperature if Sensor available
    u8g2.print("\xb0");
    u8g2.print("C");
  }
#endif

  oled.display();
  startScreenActive=true;
} // end mistertext


// --------------------------------------------------------------
// ------------------ Enable/Disable ttyack ---------------------
// --------------------------------------------------------------
void oled_setttyack(void) {
  String xT="";
  int x;
#ifdef XDEBUG
  Serial.println("Called Command CMDSTTYACK");
#endif
  xT=newCommand.substring(newCommand.indexOf(',')+1);
#ifdef XDEBUG
  Serial.printf("\nReceived Text: %s\n", (char*)xT.c_str());
#endif
  
  x=xT.toInt();                                 // Convert Value
  if (x<0) x=0;
  if (x>1) x=1;

  if (x) {
    sendTTYACK = true;
  }
  else {
    sendTTYACK = false;
  }
}


// --------------------------------------------------------------
// ---------------- Read and set RTC Time -----------------------
// --------------------------------------------------------------
void oled_setTime(void) {
  String tT="";
  
#ifdef XDEBUG
  Serial.println("Called Command CMDSETTIME");
#endif

  tT=newCommand.substring(newCommand.indexOf(',')+1);             // Get Command Parameter out of the string
  
#ifdef XDEBUG
  Serial.printf("\nReceived Text: %s\n", (char*)newCommand.c_str());
  Serial.printf("Received Value: %s\n", (char*)tT.c_str());
#endif

#ifdef ESP32X                                                      // Set Time only for ESP32 MCU's
  rtc.setTime(tT.toInt());                                        // Read and set RTC
  timeIsSet = true;                                               // Time is set!
#endif
}


// --------------------------------------------------------------
// ------------ Read and Set Command Delay ----------------------
// --------------------------------------------------------------
void oled_setcdelay(void) {
  String dT="";
#ifdef XDEBUG
  Serial.println("Called Command CMDSECD");
#endif
  
  dT=newCommand.substring(8);           // CMD-Length+1

#ifdef XDEBUG
  Serial.printf("\nReceived Text: %s\n", (char*)dT.c_str());
#endif
  cDelay=dT.toInt();                   // Convert Value
#ifdef XDEBUG
  Serial.printf("\nSet cDelay to: %d\n", cDelay);
#endif
}


// --------------------------------------------------------------
// ------------- Show Command Delay on Screen -------------------
// --------------------------------------------------------------
void oled_showcdelay(void) {
#ifdef XDEBUG
  Serial.println("Called Command CMDSHCD");
#endif
  
  oled.clearDisplay();
  u8g2.setFont(u8g2_font_tenfatguys_tr);
  u8g2.setCursor(20,32);
  u8g2.print("cDelay: ");
  u8g2.print(cDelay);
  oled.display();
}


// --------------------------------------------------------------
// ---------------- Switch Screensaver On/Off -------------------
// --------------------------------------------------------------
void oled_switchscreensaver(void) {
  String xT="";
  int x;
#ifdef XDEBUG
  Serial.println("Called Command CMDSWSAVER");
#endif
  xT=newCommand.substring(newCommand.indexOf(',')+1);
#ifdef XDEBUG
  Serial.printf("\nReceived Text: %s\n", (char*)xT.c_str());
#endif
  
  x=xT.toInt();                               // Convert Value
  if (x<0) x=0;                               // Range checks
  if (x>1) x=1;

  if (x==0) {
#ifdef XDEBUG
    Serial.println("Switch ScreenSaver off.");
#endif
    ScreenSaverEnabled = false;
    ScreenSaverTimer=0;                       // Reset Screensaver-Timer
    ScreenSaverLogoTimer=0;                   // Reset ScreenSaverLogo-Timer
  }  // endif

  if (x==1) {
    if (ScreenSaverMode>0) {
#ifdef XDEBUG
      Serial.printf("Switch ScreenSaver on, Mode: %i.\n", ScreenSaverMode);
#endif
      ScreenSaverEnabled = true;
      ScreenSaverTimer=0;                     // Reset Screensaver-Timer
      ScreenSaverLogoTimer=0;                 // Reset ScreenSaverLogo-Timer
    }
    else {
#ifdef XDEBUG
      Serial.println("ScreenSaver unset!");
#endif
    }
  }  //endif
}


// --------------------------------------------------------------
// ----------------- Set ScreenSaver Mode -----------------------
// --------------------------------------------------------------
void oled_readnsetscreensaver(void) {
  String TextIn="",mT="",iT="",lT="";
  int d1,d2,m,i,l,b;
#ifdef XDEBUG
  Serial.println("Called Command CMDSAVER");
#endif
  TextIn=newCommand.substring(9);
#ifdef XDEBUG
  Serial.printf("Received Text: %s\n", (char*)TextIn.c_str());
#endif
 
  //Searching for the "," delimiter
  d1 = TextIn.indexOf(',');                 // Find location of first ","
  d2 = TextIn.indexOf(',', d1+1 );          // Find location of second ","
  //Create Substrings
  mT = TextIn.substring(0, d1);             // Get String for Mode/Color
  iT = TextIn.substring(d1+1, d2);          // Get String for Interval
  lT = TextIn.substring(d2+1);              // Get String for Logo-Time

  m=mT.toInt();                             // Convert Mode
  i=iT.toInt();                             // Convert Interval
  l=lT.toInt();                             // Convert Logo-Time

  if (m<0) m=0;                             // Check & Set Mode
  if (m>255) m=255;                         // Check & Set Mode (8 Bits = 0..255)
  if (i<5) i=5;                             // Check&Set Minimum Interval
  if (i>600) i=600;                         // Check&Set Maximiun Interval
  if (l<20) l=20;                           // Check&Set Minimum Logo-Time
  if (l>600) l=600;                         // Check&Set Maximiun Logo-Time

  // Get&Set Active ScreenSaverScreens
  ScreenSaverCountScreens=0;                                               // Reset Counter   
  for (b=0; b<ScreenSaverMaxScreens; b++) ScreenSaverActiveScreens[b]=0;   // Clear Array
  for (b=0; b<ScreenSaverMaxScreens; b++) {
    if (bitRead(m,b)) {                                                    // Read Bits out of Mode and if Bit is "1"...
      ScreenSaverActiveScreens[ScreenSaverCountScreens]=b+1;               // ...write the value in the Screens-Array[0..x] and..
      ScreenSaverCountScreens++;                                           // ...count up the Counter.
    }
  }
#ifdef ESP32X    
  ShowScreenSaverStarField=bitRead(m,5) && !bitRead(m,6);                  // StarField ScreenSaver active ?
  ShowScreenSaverToaster=!bitRead(m,5) && bitRead(m,6);                    // Toaster ScreenSaver active ?
  ShowScreenSaverAnimated=bitRead(m,5) && bitRead(m,6);                    // All Animated ScreenSaver
#endif

#ifdef XDEBUG
  Serial.printf("Active ScreenSaverScreens: %i\n", ScreenSaverCountScreens);
  for (b=0; b<ScreenSaverMaxScreens; b++) {
    Serial.printf("ScreenSaver Array Value No.%i: %i\n", b, ScreenSaverActiveScreens[b]);
  }
  if (ShowScreenSaverStarField) Serial.printf("ScreenSaver StarField active!\n");
#endif
  
#ifdef XDEBUG
  Serial.printf("Created Strings: M:%s I:%s L:%s\n", (char*)mT.c_str(), (char*)iT.c_str(), (char*)lT.c_str());
  Serial.printf("Values: M:%i T:%i L:%i\n", m, i, l);
#endif

  ScreenSaverMode=m;
  ScreenSaverTimer=0;                       // Reset Screensaver-Timer
  ScreenSaverLogoTimer=0;                   // Reset ScreenSaverLogo-Timer

  if (m==0) {
#ifdef XDEBUG
    Serial.println("ScreenSaver Disabled!");
#endif
    ScreenSaverEnabled=false;
  }
  else{
#ifdef XDEBUG
    Serial.println("ScreenSaver Enabled!");
#endif
    ScreenSaverEnabled=true;
    ScreenSaverInterval=i;                    // Set ScreenSaverTimer Interval
#ifdef USE_NODEMCU
    ScreenSaverLogoTime=l-i;                  // Set ScreenSaverLogoTime (First Screensaver shown after ScreenSaverLogoTime-ScreenSaverInterval+ScreenSaverInterval)
#endif
#ifdef ESP32X
    if (ShowScreenSaverStarField || ShowScreenSaverToaster || ShowScreenSaverAnimated) {
      ScreenSaverLogoTime=l;                  // Set ScreenSaverLogoTime (Screensaver shown after ScreenSaverLogoTime)
    }
    else {
      ScreenSaverLogoTime=l-i;                // Set ScreenSaverLogoTime (First Screensaver shown after ScreenSaverLogoTime-ScreenSaverInterval+ScreenSaverInterval)
    }
#endif
  }
}


// --------------------------------------------------------------
// ------------ Show ScreenSaver Pictures/Time  -----------------
// --------------------------------------------------------------
void oled_showScreenSaverPicture(void) {
  int l,x,y;
  String actTime="";
  oled.setContrast(ScreenSaverContrast);                        // Set Contrast for ScreenSaver Mode

