venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
  l=ScreenSaverActiveScreens[random(ScreenSaverCountScreens)];  // Get random Screen out of the Active-Screens-Array[0..x]
#ifdef XDEBUG
  Serial.printf("Screen: %i\n", l);
#endif

  switch (l) {
    case 1:                                             // Show tiny tty2oled Logo
      oled.clearDisplay();
      x=random(DispWidth - tty2oled_logo32_width);
      y=random(DispHeight - tty2oled_logo32_height);
      oled.drawXBitmap(x, y, tty2oled_logo32, tty2oled_logo32_width, tty2oled_logo32_height, SSD1322_WHITE);
      oled.display();
    break;
    case 2:                                             // Show tiny MiSTer Logo
      oled.clearDisplay();
      x=random(DispWidth - mister_logo32_width);
      y=random(DispHeight - mister_logo32_height);
      oled.drawXBitmap(x, y, mister_logo32, mister_logo32_width, mister_logo32_height, SSD1322_WHITE);
      oled.display();
    break;
    case 3:                                             // Show 1/4 Version of the actual Core
      x=random(DispWidth - DispWidth/2);
      y=random(DispHeight - DispHeight/2);
      oled_showSmallCorePicture(x,y);
    break;
#ifdef ESP32X
    case 4:                                             // Show Time for ESP32
      oled.clearDisplay();
      if (timeIsSet) {
        u8g2.setFont(u8g2_font_luBS24_tf);
        actTime=rtc.getTime("%H:%M");
        x=random(DispWidth - u8g2.getUTF8Width(actTime.c_str()));
        y=random(u8g2.getFontAscent(), DispHeight);
        u8g2.setCursor(x,y);
        u8g2.print(actTime);
      }
      else {
        oled_showcenterredtext("Time not set!",9);
      }
      oled.display();
    break;
    case 5:                                            // Show Date for ESP32
      oled.clearDisplay();
      if (timeIsSet) {
        u8g2.setFont(u8g2_font_luBS14_tf);
        actTime=rtc.getTime("%d-%b-%y");
        x=random(DispWidth - u8g2.getUTF8Width(actTime.c_str()));
        y=random(u8g2.getFontAscent(), DispHeight);
        u8g2.setCursor(x,y);
        u8g2.print(actTime);
      }
      else {
        oled_showcenterredtext("Date not set!",9);
      }
      oled.display();
    break;
#endif
    default:
      oled.clearDisplay();
      x=random(DispWidth - tty2oled_logo32_width);
      y=random(DispHeight - tty2oled_logo32_height);
      oled.drawXBitmap(x, y, tty2oled_logo32, tty2oled_logo32_width, tty2oled_logo32_height, SSD1322_WHITE);
      oled.display();
    break;
  } //end switch
}


// --------------------------------------------------------------
// ------------- Show 1/4 Core Picture at Position V2 -----------
// --------------------------------------------------------------
// xpos & ypos = Offset
void oled_showSmallCorePicture(int xpos, int ypos) {
  int x=0,y=0,px=0,py=0,i=0;
  unsigned char b1,b2,br;

#ifdef XDEBUG
  Serial.printf("Show 1/4 Pic, ActPicType: %d\n",actPicType);
#endif
  
  oled.clearDisplay();
  switch (actPicType) {
    case XBM:
      x=0;y=0;
      for (py=0; py<DispHeight; py=py+2) {
        for (px=0; px<DispLineBytes1bpp; px++) {
          b1=logoBin[px+py*DispLineBytes1bpp];                       // Get Data Byte for 8 Pixels
          for (i=0; i<8; i=i+2){
            if (bitRead(b1, i)) {
              oled.drawPixel(xpos+x, ypos+y, SSD1322_WHITE);         // Draw Pixel if "1"
            }
            else {
              oled.drawPixel(xpos+x, ypos+y, SSD1322_BLACK);         // Clear Pixel if "0"
            }
#ifdef XDEBUG
            Serial.printf("X: %d Y: %d\n",x,y);
#endif
            x++;
          }
#ifdef USE_NODEMCU
          yield();
#endif
        }
        x=0;
        y++;
      }
      oled.display();  
    break;
    case GSC:
      x=0;y=0;
      for (py=0; py<DispHeight; py=py+2) {
        for (px=0; px<DispLineBytes1bpp; px++) {
          for (i=0; i<4; i++) {
            b1=logoBin[(px*4)+i+py*DispLineBytes4bpp];                                                  // Get Data Byte 1 for 2 Pixels
            b2=logoBin[(px*4)+i+(py+1)*DispLineBytes4bpp];                                              // Get Data Byte 2 for 2 Pixels
            //br=(((0xF0 & b1) >> 4) + (0x0F & b1) + ((0xF0 & b2) >> 4) + (0x0F & b2)) / 4;               // cutting
            br=round((((0xF0 & b1) >> 4) + (0x0F & b1) + ((0xF0 & b2) >> 4) + (0x0F & b2)) / 4);        // rounding
            oled.drawPixel(xpos+x, ypos+y, br);   // Draw only Pixel 1, Left Nibble
            //Serial.printf("X: %d Y: %d\n",x,y);
            x++;
          }
#ifdef USE_NODEMCU
          yield();
#endif
        }
      x=0;
      y++;
      }
      oled.display();  
    break;
    case NONE:
      oled_showcorename();
    break;
  }
}


// --------------------------------------------------------------
// ----------- Show System Hardware Info on Screen --------------
// --------------------------------------------------------------
void oled_showSystemHardware(void) {
  int hwinfo=0;

#ifdef XDEBUG
  Serial.println("Called Command CMDSHSYSHW");
#endif

#ifdef USE_ESP32DEV                        // TTGO-T8 & d.ti Board
  hwinfo=1;
#endif

#ifdef USE_LOLIN32                         // Wemos LOLIN32, LOLIN32, DevKit_V4 (Wemos Lolin32)
  hwinfo=2;
#endif

#ifdef USE_NODEMCU                         // ESP8266 NodeMCU
  hwinfo=3;
#endif

#ifdef USE_ESP32S3DEV
  hwinfo=4;
#endif

  oled.clearDisplay();
  u8g2.setFont(u8g2_font_luBS10_tf);
  u8g2.setCursor(0,10);
  u8g2.print("SysInfo");

  u8g2.setFont(u8g2_font_luBS08_tf);
  u8g2.setCursor(0,25);
  u8g2.print("FW Version: " BuildVersion);

  u8g2.setCursor(0,35);
  u8g2.print("Board Type: ");
  
  switch (hwinfo) {
    case 0:
      u8g2.print("Unknown");                 // Unknow Hardware
    break;
    case 1:
      u8g2.print("ESP32-DEV");               // ESP32-DEV, TTGO, DTI-Board
      if (dtiv>=11) {
        u8g2.printf(", d.ti v%.1f", (float)dtiv/10);
      }
    break;
    case 2:
      u8g2.print("WEMOS LOLIN32");           // Wemos,Lolin,DevKit_V4
    break;
    case 3:
      u8g2.print("NodeMCU 1.0");             // ESP8266
    break;
    case 4:
      u8g2.print("ESP32S3-DEV");             // ESP32S3
      if (dtiv>=11) {
        u8g2.printf(", d.ti v%.1f", (float)dtiv/10);
      }
    break;
    default:
      u8g2.print("Other");                   // Everything else
    break;
  }

  u8g2.setCursor(0,50);
  u8g2.print("Board Options: ");
  u8g2.setCursor(0,60);
  if (dtiv>=11) {
    if (hasMIC) u8g2.print("MIC");
    if (hasPCA) u8g2.print(",PCA");
    if (hasLED) u8g2.print(",LED");
    if (hasRGBLED) u8g2.print(",RGB");
    if (hasBUZZER) u8g2.print(",BUZ");
  }
  else {
    u8g2.print("None");
  }

  oled.display();  
}

// --------------------------------------------------------------
// ----------- Send Hardware Info Back to the MiSTer ------------
// --------------------------------------------------------------
void oled_sendHardwareInfo(void) {
  int hwinfo=0;

#ifdef USE_ESP32DEV                        // TTGO-T8 & d.ti Board
  hwinfo=1;
#endif

