venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
  x=xT.toInt();                                 // Convert Value
  
  if (hasPLED) {                                // PCA not avail = Board Rev 1.1 = LED
    if (x<0) x=0;
    if (x>1) x=1;
    digitalWrite(POWER_LED,!x);                 // Need to negate Signal, Pin = 1 LED's off
  }
  else {
    oled_showcenterredtext("No P-LED!",3);
  }
}

// --------------------------------------------------------------
// --------- Play Note/Tone using Piezo Beeper ------------------
// --------------------------------------------------------------
void oled_playnote(void) {
  int d0=0,d1=0,d2=0,d3=0,d4=0,o=0,d=0,p=0;
  String TextIn="",nT="",oT="",dT="",pT="";
  note_t n=NOTE_C;
  bool pError=false;
  
#ifdef XDEBUG
  Serial.println("Called Command CMDPNOTE");
#endif  
  
  TextIn=newCommand.substring(newCommand.indexOf(','));  // Find the first "," after the command
  d0 = TextIn.indexOf(',');                 // Find location of the Starting ","

#ifdef XDEBUG
  Serial.printf("\nReceived Text: %s\n", (char*)TextIn.c_str());
  Serial.printf("Find first delimeter at: %d\n", d0);
#endif  

  if (hasBUZZER){                                 // only on d.ti Board >= Rev 1.2
    ledcAttach(BUZZER, LEDC_FREQ , LEDC_RESO);

    do {
      // find ","
      d1 = TextIn.indexOf(',', d0+1 );          // Find location of first ","
      d2 = TextIn.indexOf(',', d1+1 );          // Find location of second ","
      d3 = TextIn.indexOf(',', d2+1 );          // Find location of third ","
      d4 = TextIn.indexOf(',', d3+1 );          // Find location of fourth "," - Value = "-1" if not found = no more Notes available

#ifdef XDEBUG
      Serial.printf("Find delimeters at: %d %d %d %d\n", d1,d2,d3,d4);
#endif  

      //Create Substrings
      nT = TextIn.substring(d0+1, d1);          // Get String for Note
      oT = TextIn.substring(d1+1, d2);          // Get String for Octave
      dT = TextIn.substring(d2+1, d3);          // Get String for Duration
      if (d4 == -1) {                           // String finished
        pT = TextIn.substring(d3+1);            // Get String for Pause
      }
      else if (d3 == -1 || d2 == -1 || d1 == -1) {  // Parameter missing = pError
        pError=true;
      }
      else {                                    // String not finished
        pT = TextIn.substring(d3+1, d4);        // Get String for Pause
        d0=d4;                                  // Set Index for next Note
      }

#ifdef XDEBUG
      Serial.printf("Found strings: %s %s %s %s\n", (char*)nT.c_str(), (char*)oT.c_str(), (char*)dT.c_str(), (char*)pT.c_str());
#endif  

      // Build Note and convert Substrings to Integers
      // See https://github.com/espressif/arduino-esp32/blob/6a7bcabd6b7a33f074f93ed60e5cc4378d350b81/cores/esp32/esp32-hal-ledc.c#L141
      // NOTE_C, NOTE_Cs, NOTE_D, NOTE_Eb, NOTE_E, NOTE_F, NOTE_Fs, NOTE_G, NOTE_Gs, NOTE_A, NOTE_Bb, NOTE_B, NOTE_MAX
      nT.toUpperCase();                         // Set Note
      if (nT == "C")   n = NOTE_C;
      if (nT == "CS")  n = NOTE_Cs;
      if (nT == "D")   n = NOTE_D;
      if (nT == "EB")  n = NOTE_Eb;
      if (nT == "E")   n = NOTE_E;
      if (nT == "F")   n = NOTE_F;
      if (nT == "FS")  n = NOTE_Fs;
      if (nT == "G")   n = NOTE_G;
      if (nT == "GS")  n = NOTE_Gs;
      if (nT == "A")   n = NOTE_A;
      if (nT == "BB")  n = NOTE_Bb;
      if (nT == "B")   n = NOTE_B;
      if (nT == "MAX") n = NOTE_MAX;
      o = oT.toInt();                           // Octave
      d = dT.toInt();                           // Duration
      p = pT.toInt();                           // Pause after playing tone

      if (o == 0 || d == 0 || p == 0) pError=true;
    
#ifdef XDEBUG
      Serial.printf("Values to Play: %s %d %d %d\n", (char*)nT.c_str(), o, d, p);
#endif  

      if (!pError) {
        ledcWriteNote(BUZZER, n, o);    // Play Note
        delay(d);                                 // Duration
        ledcWriteTone(BUZZER, 0);       // Buzzer off
        delay(p);                                 // Pause
      }
      else {
        oled_showperror(); 
#ifdef XDEBUG
        Serial.printf("Parameter Error!\n");
#endif  
      }
    } while (d4 != -1 && !pError);                         // Repeat as long a fourth "," is found

    ledcDetach(BUZZER);

  }  // endif dtiv>=12
  else {
    oled_showcenterredtext("No Buzzer!",3);
#ifdef XDEBUG
    Serial.printf("No Buzzer!\n");
#endif  
  }
}

// --------------------------------------------------------------
// -------- Play Tone/Frequency using Piezo Beeper --------------
// --------------------------------------------------------------
void oled_playtone(void) {
  int d0=0,d1=0,d2=0,d3=0,f=0,d=0,p=0;
  String TextIn="",fT="",dT="",pT="";
  bool pError=false;
  
#ifdef XDEBUG
  Serial.println("Called Command CMDPTONE");
#endif  

  TextIn=newCommand.substring(newCommand.indexOf(','));  // Find the first "," after the command
  d0 = TextIn.indexOf(',');                 // Find location of the Starting ","

#ifdef XDEBUG
  Serial.printf("\nReceived Text: %s\n", (char*)TextIn.c_str());
  Serial.printf("Find first delimeter at: %d\n", d0);
#endif  

  if (hasBUZZER){                                 // only on d.ti Board >= Rev 1.2
    ledcAttach(BUZZER, LEDC_FREQ, LEDC_RESO );

    do {
      // find ","
      d1 = TextIn.indexOf(',', d0+1 );          // Find location of first ","
      d2 = TextIn.indexOf(',', d1+1 );          // Find location of second ","
      d3 = TextIn.indexOf(',', d2+1 );          // Find location of third "," - Value = "-1" if not found = no more Notes available

      //Create Substrings
      fT = TextIn.substring(d0+1, d1);          // Get String for Frequency
      dT = TextIn.substring(d1+1, d2);          // Get String for Duration
      if (d3 == -1) {                           // String finished
        pT = TextIn.substring(d2+1);            // Get String for Pause
      }
      else if (d2 == -1 || d1 == -1) {          // Parameter missing = pError
        pError=true;
      }
      else {                                    // String not finished
        pT = TextIn.substring(d2+1, d3);        // Get String for Pause
        d0=d3;                                  // Set Index for next Tone
      }

      f = fT.toInt();                           // Octave
      d = dT.toInt();                           // Duration
      p = pT.toInt();                           // Pause after playing tone

      if (f == 0 || d == 0 || p == 0) pError=true;
    
#ifdef XDEBUG
      Serial.printf("Values to Play: %d %d %d\n", f, d, p);
#endif  
      if (!pError) {
        ledcWriteTone(BUZZER, f);       // Play Frequency
        delay(d);                                 // Duration
        ledcWriteTone(BUZZER, 0);       // Buzzer off
        delay(p);                                 // Pause
      }
      else {
        oled_showperror();      
#ifdef XDEBUG
        Serial.printf("Parameter Error!\n");
#endif  
      }
    } while (d3 != -1 && !pError);                         // Repeat as long as a third "," is found

    ledcDetach(BUZZER);

  }  // endif dtiv>=12
  else {
    oled_showcenterredtext("No Buzzer!",3);
#ifdef XDEBUG
    Serial.printf("No Buzzer!\n");
#endif  
  }
}

// --------------------------------------------------------------
// -------------------- Write DTIV Value ------------------------
// --------------------------------------------------------------
void oled_readnsetedtiv(void) {
  String vT="";
  int v;

#ifdef XDEBUG
  Serial.println("Called Command CMDWRDTIV");
#endif

