venice1200/MiSTer_tty2oled/Testing/MiSTer_SSD1322_USB_Testing_ESP32_v3.x/MiSTer_SSD1322_USB_Testing_ESP32_v3.x.ino
  vT=newCommand.substring(newCommand.indexOf(',')+1);

#ifdef XDEBUG
  Serial.printf("Received Text: %s\n", (char*)TextIn.c_str());
#endif
 
  v=vT.toInt();                             // Convert Interval

  if (v<0) v=0;                             // Check Value
  if (v>255) v=255;                         // Check Value
  
  oled.clearDisplay();
  u8g2.setFont(u8g2_font_luBS08_tf);
  prefs.begin("tty2oled", false);             // Preferences Handling, open Namespace
  prefs.putUChar("dtiv", v);                  // Write Value to Preferences Namespace
  prefs.end();                                // Close the Preferences 
#ifdef XDEBUG
  Serial.printf("Write Value %i to Preferences DTIV.\n",v);
#endif
  u8g2.setCursor(0,25);
  u8g2.printf("Write Value %i to Preferences DTIV.\n",v);
  oled.display();
}

#endif  // ----------- d.ti functions endif ESP32DEV---------------


// -------------- ESP32 Functions -------------------- 
#ifdef ESP32X  // OTA, Reset and Time are only for ESP32

// --------------------------------------------------------------
// ----------- Draw the ScreenSaver Flying Toaster --------------
// --------------------------------------------------------------
void oled_drawScreenSaverToaster() {
  uint8_t i, f;
  int16_t x, y;
  bool resort = false;     // By default, don't re-sort depths

  oled.clearDisplay();
  for(i=0; i<TOAST_FLYERS; i++) { // For each flyer...
    // First draw each item...
    f = (flyer[i].frame == 255) ? 4 : (flyer[i].frame++ & 3); // Frame #
    x = flyer[i].x / TOAST_MPIX;
    y = flyer[i].y / TOAST_MPIX;
    oled.drawBitmap(x, y, tmask[f], 32, 32, SSD1322_BLACK);
    oled.drawBitmap(x, y, timg[f], 32, 32, SSD1322_WHITE);

    // Update position..
    flyer[i].x -= flyer[i].depth * 2; // Update position based on depth,
    flyer[i].y += flyer[i].depth;     // for a sort of pseudo-parallax effect.

    // ..checking if item moved off screen the re-set it.
    if((flyer[i].y >= (64*TOAST_MPIX)) || (flyer[i].x <= (-32*TOAST_MPIX))) {
      //flyer[i].x = (-32 + random(255+32)) * TOAST_MPIX;
      flyer[i].x = (-32 + random(256+32+32)) * TOAST_MPIX;
      if (flyer[i].x >= 256 * TOAST_MPIX) {
        flyer[i].y = (-32 + random(63+32)) * TOAST_MPIX;
        flyer[i].x = 256 * TOAST_MPIX;      
      }
      else {
        flyer[i].y = (-32) * TOAST_MPIX;
      }
      flyer[i].frame = random(3) ? random(4) : 255; // 66% toaster, else toast
      flyer[i].depth = 10 + random(TOAST_MPIX);
      resort = true;
    }
  }
  oled.display();
  delay(TOAST_DELAY);
}


// --------------------------------------------------------------
// ------ Calculate Random Values, used by the StarField --------
// --------------------------------------------------------------
int getRandom(int lower, int upper) {
    return lower + static_cast<int>(rand() % (upper - lower + 1));      // return a random number between lower and upper bound
}


// --------------------------------------------------------------
// -------------- Draw the ScreenSaver StarField ----------------
// --------------------------------------------------------------
void oled_drawScreenSaverStarField() {
  int origin_x = oled.width() / 2;
  int origin_y = oled.height() / 2;
  int x,y,s,c;
  double k;
  
   oled.clearDisplay();
  // Iterate through the stars reducing the z co-ordinate in order to move the Star closer.
  for (int i = 0; i < starCount; ++i) {
    stars[i][2] -= 0.19;
    // if the star has moved past the screen (z < 0) reposition it far away with random x and y positions.
    if (stars[i][2] <= 0) {
      stars[i][0] = getRandom(-25, 25);
      stars[i][1] = getRandom(-25, 25);
      stars[i][2] = maxDepth;
    }

    // Convert the 3D coordinates to 2D using perspective projection.
    k = oled.width() / stars[i][2];
    x = static_cast<int>(stars[i][0] * k + origin_x);
    y = static_cast<int>(stars[i][1] * k + origin_y);

    // Draw the star (if it is visible in the screen). Distant stars are smaller and brighter than closer stars.
    if ((0 <= x and x < oled.width()) and (0 <= y and y < oled.height())) {
      s = (1 - stars[i][2] / maxDepth) * 4;     // Star Size
      //c = (1 - stars[i][2] / maxDepth) * 20;  // Color
	  c = stars[i][2] / -2 + 16;                // Star Color, z=32..0 => c=0..16 
      if (c<0) c=0;
      if (c>15) c=15;
      oled.fillRect(x, y, s, s, c);
      //oled.fillRect(x, y, s, s, 15);
    }
  }
  oled.display();
}

// --------------------------------------------------
// ----------------- Show Time ---------------------- 
// --------------------------------------------------
void oled_showtime(void) {
  String actTime=rtc.getTime("%H:%M");                    // Get Hrs and Secs

#ifdef XDEBUG
  Serial.println("Called Command CMDSHTIME");
#endif  

  oled.clearDisplay();
  u8g2.setForegroundColor(15);                            // Set Font Color
  u8g2.setBackgroundColor(0);                             // Set Background Color
  u8g2.setFont(u8g2_font_5x7_mf);                         // Set Font
  u8g2.setCursor(0,8);                                    // Set Cursor Position
  u8g2.print("Show Time");                                     // Write Text
  u8g2.setFont(u8g2_font_7Segments_26x42_mn);             // Set Font
  u8g2.setCursor(55,58);                                  // Set Cursor Position
  u8g2.print(actTime);                                    // Write Text
  oled.display();                                         // Output Text
}

#endif // ESP32

//========================== The end ================================
